// ---------------------------------------
// 課題9：繰り返し処理を使用して祝日を表示しよう
// ---------------------------------------
// 休日の一覧を定義する
const holidays = ['正月','成人の日','建国記念日','天皇誕生日','春分の日','昭和の日','憲法記念日','みどりの日','こどもの日','海の日','山の日','敬老の日','秋分の日','スポーツの日','文化の日','勤労感謝の日'];

// 繰り返しの終了条件（休日数）を設定しておく
const numberOfholidays = 16;

// まず、for文で出力する
for (let i = 0; i < numberOfholidays; i++) {
  console.log(holidays[i]);
}

// 次に、for文で出力する
i = 0;
while (i < numberOfholidays) {
  console.log(holidays[i]); 
  i++;
}

// EOF